spec/fixtures/dhl_cassettes/tracking/6676848415.yml

---
http_interactions:
- request:
    method: post
    uri: https://wsbuat.dhl.com:8300/gbl/glDHLExpressTrack
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://scxgxtt.phx-dc.dhl.com/glDHLExpressTrack/providers/services/trackShipment"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.dhl.com"
        xmlns:dhl="http://www.dhl.com"><env:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><wsse:UsernameToken
        wsu:Id="UsernameToken-1" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsse:Username>username</wsse:Username><wsse:Password
        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">password</wsse:Password></wsse:UsernameToken><wsu:Timestamp
        wsu:Id="Timestamp-2" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><wsu:Created>2013-06-01T07:10:48Z</wsu:Created><wsu:Expires>2013-06-01T07:11:48Z</wsu:Expires></wsu:Timestamp></wsse:Security></env:Header><env:Body><tns:trackShipmentRequest><trackingRequest><dhl:TrackingRequest><Request><ServiceHeader><MessageTime>2013-06-01T07:10:48+00:00</MessageTime><MessageReference>1234567890123456789012345678</MessageReference></ServiceHeader></Request><AWBNumber><ArrayOfAWBNumberItem>6676848415</ArrayOfAWBNumberItem></AWBNumber><LevelOfDetails>ALL_CHECK_POINTS</LevelOfDetails><PiecesEnabled>B</PiecesEnabled></dhl:TrackingRequest></trackingRequest></tns:trackShipmentRequest></env:Body></env:Envelope>
    headers:
      Soapaction:
      - '"glDHLExpressTrack_providers_services_trackShipment_Binder_trackShipmentRequest"'
      Content-Type:
      - text/xml;charset=UTF-8
      Content-Length:
      - '1592'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Sat, 01 Jun 2013 07:10:50 GMT
      Server:
      - ACE XML Gateway
      Content-Type:
      - text/xml
      Content-Length:
      - '12426'
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="utf-8"?>
        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"></SOAP-ENV:Header><SOAP-ENV:Body>
        <ser-root:trackShipmentRequestResponse xmlns:ser-root="http://scxgxtt.phx-dc.dhl.com/glDHLExpressTrack/providers/services/trackShipment"><trackingResponse xmlns:ns="http://www.dhl.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
        <ns:TrackingResponse>
          <Response>
            <ServiceHeader>
              <MessageTime>2013-06-01T07:10:51Z</MessageTime>
              <MessageReference>63af0bd0ca8a11e2bc8685af92ec7abc</MessageReference>
            </ServiceHeader>
          </Response>
          <AWBInfo>
            <ArrayOfAWBInfoItem>
              <AWBNumber>6676848415</AWBNumber>
              <Status>
                <ActionStatus>Success</ActionStatus>
              </Status>
              <ShipmentInfo>
                <OriginServiceArea>
                  <ServiceAreaCode>AOI</ServiceAreaCode>
                  <Description>Ancona - Italy</Description>
                </OriginServiceArea>
                <DestinationServiceArea>
                  <ServiceAreaCode>HAM</ServiceAreaCode>
                  <Description>Hamburg - Germany</Description>
                  <FacilityCode>HAM</FacilityCode>
                </DestinationServiceArea>
                <ShipperName>TECH-POL S.R.L.                              </ShipperName>
                <ConsigneeName>CKD SLG HAMBURG                              </ConsigneeName>
                <ShipmentDate>2013-05-06T15:00:00+02:00</ShipmentDate>
                <Pieces>1</Pieces>
                <Weight>6.000</Weight>
                <ShipmentEvent>
                  <ArrayOfShipmentEventItem>
                    <Date>2013-05-07</Date>
                    <Time>09:07:00</Time>
                    <ServiceEvent>
                      <EventCode>AR</EventCode>
                      <Description>Arrival in Delivery Facility</Description>
                    </ServiceEvent>
                    <Signatory></Signatory>
                    <ServiceArea>
                      <ServiceAreaCode>HAM</ServiceAreaCode>
                      <Description>Hamburg - Germany</Description>
                    </ServiceArea>
                  </ArrayOfShipmentEventItem>
                </ShipmentEvent>
              </ShipmentInfo>
              <Pieces>
                <PieceInfo>
                  <ArrayOfPieceInfoItem>
                    <PieceDetails>
                      <AWBNumber>6676848415</AWBNumber>
                      <LicensePlate>JD0003900005241328421</LicensePlate>
                      <ActualDepth>66.000</ActualDepth>
                      <ActualWidth>48.000</ActualWidth>
                      <ActualHeight>42.000</ActualHeight>
                      <Depth>60.000</Depth>
                      <Width>40.000</Width>
                      <Height>30.000</Height>
                      <Weight>6.000</Weight>
                      <PackageType></PackageType>
                      <DimWeight>10.100</DimWeight>
                      <WeightUnit>KG</WeightUnit>
                    </PieceDetails>
                    <PieceEvent>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-07</Date>
                        <Time>10:42:00</Time>
                        <ServiceEvent>
                          <EventCode>OK</EventCode>
                          <Description>Delivery </Description>
                        </ServiceEvent>
                        <Signatory>ECKHARDT</Signatory>
                        <ServiceArea>
                          <ServiceAreaCode>HAM</ServiceAreaCode>
                          <Description>Hamburg - Germany</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-07</Date>
                        <Time>10:03:00</Time>
                        <ServiceEvent>
                          <EventCode>WC</EventCode>
                          <Description>With Delivering Courier </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>HAM</ServiceAreaCode>
                          <Description>Hamburg - Germany</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-07</Date>
                        <Time>03:50:40</Time>
                        <ServiceEvent>
                          <EventCode>DF</EventCode>
                          <Description>Depart Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>LEJ</ServiceAreaCode>
                          <Description>Leipzig - Germany</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-07</Date>
                        <Time>02:46:55</Time>
                        <ServiceEvent>
                          <EventCode>PL</EventCode>
                          <Description>Processed at Location </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>LEJ</ServiceAreaCode>
                          <Description>Leipzig - Germany</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-07</Date>
                        <Time>01:47:31</Time>
                        <ServiceEvent>
                          <EventCode>AF</EventCode>
                          <Description>Arrived Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>LEJ</ServiceAreaCode>
                          <Description>Leipzig - Germany</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>23:47:22</Time>
                        <ServiceEvent>
                          <EventCode>DF</EventCode>
                          <Description>Depart Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>BLQ</ServiceAreaCode>
                          <Description>Bologna - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>23:45:40</Time>
                        <ServiceEvent>
                          <EventCode>TR</EventCode>
                          <Description>Record of Transit </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>BLQ</ServiceAreaCode>
                          <Description>Bologna - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>20:42:47</Time>
                        <ServiceEvent>
                          <EventCode>DF</EventCode>
                          <Description>Depart Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:37:00</Time>
                        <ServiceEvent>
                          <EventCode>AF</EventCode>
                          <Description>Arrived Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:37:00</Time>
                        <ServiceEvent>
                          <EventCode>AF</EventCode>
                          <Description>Arrived Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:34:00</Time>
                        <ServiceEvent>
                          <EventCode>DF</EventCode>
                          <Description>Depart Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:34:00</Time>
                        <ServiceEvent>
                          <EventCode>AF</EventCode>
                          <Description>Arrived Facility </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:33:09</Time>
                        <ServiceEvent>
                          <EventCode>PL</EventCode>
                          <Description>Processed at Location </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:32:23</Time>
                        <ServiceEvent>
                          <EventCode>SI</EventCode>
                          <Description>Security Inspection </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>18:31:00</Time>
                        <ServiceEvent>
                          <EventCode>RW</EventCode>
                          <Description>Weigh and Dimension </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                      <ArrayOfPieceEventItem>
                        <Date>2013-05-06</Date>
                        <Time>09:41:00</Time>
                        <ServiceEvent>
                          <EventCode>PU</EventCode>
                          <Description>Shipment Pickup </Description>
                        </ServiceEvent>
                        <ServiceArea>
                          <ServiceAreaCode>AOI</ServiceAreaCode>
                          <Description>Ancona - Italy</Description>
                        </ServiceArea>
                        <ShipperReference xsi:nil="true"></ShipperReference>
                      </ArrayOfPieceEventItem>
                    </PieceEvent>
                  </ArrayOfPieceInfoItem>
                </PieceInfo>
              </Pieces>
            </ArrayOfAWBInfoItem>
          </AWBInfo>
        </ns:TrackingResponse></trackingResponse></ser-root:trackShipmentRequestResponse></SOAP-ENV:Body>
        </SOAP-ENV:Envelope>
    http_version:
  recorded_at: Sat, 01 Jun 2013 07:10:52 GMT
recorded_with: VCR 2.5.0
